In [1]:
# SQL-2 Assignment

In [2]:
#. 1. Cerate an sqlalchemy engine using a sample from the data set
# 2. Write two basic update queries
# 3. Write two delete queires
# 4. Write two filter quries
# 5. Write to funciton quries

In [3]:
import numpy as np
import pandas as pd
import sqlite3

In [4]:
adult_data_df= pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')

In [5]:
adult_data_df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [6]:
adult_data_df.columns =["age","workclass","fnlwgt","education","education_num","marital_status","occupation","relationship","race","sex","capital_gain","capital_loss","hours_per_week","native_country","income"]

In [7]:
adult_data_df.head(5)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [14]:
# Q.1: Create an sqlalchemy engine using a sample from the data set

In [15]:

import sqlalchemy 
from sqlalchemy import create_engine
engine = create_engine('sqlite:///sqladb', echo=False)

In [12]:
connection = sqlite3.connect("sqladb")
cursor = connection.cursor()

In [16]:
# Q.2: write two basic updte queries

In [17]:
cursor.execute('UPDATE sqladb SET fnlwgt = "1515" WHERE fnlwgt = " 83311"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(2))

Empty DataFrame
Columns: [index, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income]
Index: []

In [18]:
cursor.execute('UPDATE sqladb SET education = "B.A" WHERE education = " Bachelors"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head())

Empty DataFrame
Columns: [index, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income]
Index: []

In [19]:
# Q3: Write two delete queries

In [20]:
cursor.execute('DELETE FROM sqladb WHERE fnlwgt = " 1515"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(2))

Empty DataFrame
Columns: [index, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income]
Index: []

In [21]:
cursor.execute('DELETE FROM sqladb WHERE age = " 53" AND fnlwgt = " 234721" and race = " Black" and Sex = " Male"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head())

Empty DataFrame
Columns: [index, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income]
Index: []

In [22]:
# Q4: WRite two filter queries

In [23]:
cursor.execute('SELECT DISTINCT * FROM sqladb WHERE workclass = " Private" AND age < 20 AND race = " White" AND native_country=" Mexico"')
output = cursor.fetchall()
print(output)

[]

In [24]:
# Q5: Write two function queries

In [26]:
def age_check():
    connection = sqlite3.connect("sqladb")
    cursor = connection.cursor()
    cursor.execute('SELECT avg(age) FROM sqladb WHERE marital_status=" Divorced" AND sex=" Male" AND occupation =" Exec-managerial"')
    output = cursor.fetchall()
    print(output)

age_check()

[(None,)]

In [29]:
def weekly_hours():
    connection = sqlite3.connect('sqladb')
    cursor = connection.cursor()
    cursor.execute('SELECT avg(hours_per_week) FROM sqladb where occupation = " Handlers-cleaners" AND sex =" Male" AND workclass = " Private"')
    output = cursor.fetchall()
    print(output)
    connection.close()
    
weekly_hours()

[(None,)]